//Напишите программу, которая на вход принимает два числа, и выдает, какое число большее, а какое меньшее
Console.Clear();
Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());


if (n % 2 == 0)
    Console.Write("yes");
else
    Console.Write("no");
